; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p5---int100n150-m25---int100c110---s34---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 - fuellevel
)

(:init
(sum level0 level7 level7)
(sum level0 level10 level10)
(sum level0 level13 level13)
(sum level0 level21 level21)
(sum level0 level24 level24)
(sum level1 level7 level8)
(sum level1 level10 level11)
(sum level1 level13 level14)
(sum level1 level21 level22)
(sum level1 level24 level25)
(sum level2 level7 level9)
(sum level2 level10 level12)
(sum level2 level13 level15)
(sum level2 level21 level23)
(sum level2 level24 level26)
(sum level3 level7 level10)
(sum level3 level10 level13)
(sum level3 level13 level16)
(sum level3 level21 level24)
(sum level3 level24 level27)
(sum level4 level7 level11)
(sum level4 level10 level14)
(sum level4 level13 level17)
(sum level4 level21 level25)
(sum level4 level24 level28)
(sum level5 level7 level12)
(sum level5 level10 level15)
(sum level5 level13 level18)
(sum level5 level21 level26)
(sum level5 level24 level29)
(sum level6 level7 level13)
(sum level6 level10 level16)
(sum level6 level13 level19)
(sum level6 level21 level27)
(sum level6 level24 level30)
(sum level7 level7 level14)
(sum level7 level10 level17)
(sum level7 level13 level20)
(sum level7 level21 level28)
(sum level7 level24 level31)
(sum level8 level7 level15)
(sum level8 level10 level18)
(sum level8 level13 level21)
(sum level8 level21 level29)
(sum level8 level24 level32)
(sum level9 level7 level16)
(sum level9 level10 level19)
(sum level9 level13 level22)
(sum level9 level21 level30)
(sum level9 level24 level33)
(sum level10 level7 level17)
(sum level10 level10 level20)
(sum level10 level13 level23)
(sum level10 level21 level31)
(sum level10 level24 level34)
(sum level11 level7 level18)
(sum level11 level10 level21)
(sum level11 level13 level24)
(sum level11 level21 level32)
(sum level11 level24 level35)
(sum level12 level7 level19)
(sum level12 level10 level22)
(sum level12 level13 level25)
(sum level12 level21 level33)
(sum level12 level24 level36)
(sum level13 level7 level20)
(sum level13 level10 level23)
(sum level13 level13 level26)
(sum level13 level21 level34)
(sum level13 level24 level37)
(sum level14 level7 level21)
(sum level14 level10 level24)
(sum level14 level13 level27)
(sum level14 level21 level35)
(sum level14 level24 level38)
(sum level15 level7 level22)
(sum level15 level10 level25)
(sum level15 level13 level28)
(sum level15 level21 level36)
(sum level15 level24 level39)
(sum level16 level7 level23)
(sum level16 level10 level26)
(sum level16 level13 level29)
(sum level16 level21 level37)
(sum level16 level24 level40)
(sum level17 level7 level24)
(sum level17 level10 level27)
(sum level17 level13 level30)
(sum level17 level21 level38)
(sum level17 level24 level41)
(sum level18 level7 level25)
(sum level18 level10 level28)
(sum level18 level13 level31)
(sum level18 level21 level39)
(sum level18 level24 level42)
(sum level19 level7 level26)
(sum level19 level10 level29)
(sum level19 level13 level32)
(sum level19 level21 level40)
(sum level19 level24 level43)
(sum level20 level7 level27)
(sum level20 level10 level30)
(sum level20 level13 level33)
(sum level20 level21 level41)
(sum level20 level24 level44)
(sum level21 level7 level28)
(sum level21 level10 level31)
(sum level21 level13 level34)
(sum level21 level21 level42)
(sum level21 level24 level45)
(sum level22 level7 level29)
(sum level22 level10 level32)
(sum level22 level13 level35)
(sum level22 level21 level43)
(sum level22 level24 level46)
(sum level23 level7 level30)
(sum level23 level10 level33)
(sum level23 level13 level36)
(sum level23 level21 level44)
(sum level23 level24 level47)
(sum level24 level7 level31)
(sum level24 level10 level34)
(sum level24 level13 level37)
(sum level24 level21 level45)
(sum level24 level24 level48)
(sum level25 level7 level32)
(sum level25 level10 level35)
(sum level25 level13 level38)
(sum level25 level21 level46)
(sum level25 level24 level49)
(sum level26 level7 level33)
(sum level26 level10 level36)
(sum level26 level13 level39)
(sum level26 level21 level47)
(sum level26 level24 level50)
(sum level27 level7 level34)
(sum level27 level10 level37)
(sum level27 level13 level40)
(sum level27 level21 level48)
(sum level27 level24 level51)
(sum level28 level7 level35)
(sum level28 level10 level38)
(sum level28 level13 level41)
(sum level28 level21 level49)
(sum level28 level24 level52)
(sum level29 level7 level36)
(sum level29 level10 level39)
(sum level29 level13 level42)
(sum level29 level21 level50)
(sum level30 level7 level37)
(sum level30 level10 level40)
(sum level30 level13 level43)
(sum level30 level21 level51)
(sum level31 level7 level38)
(sum level31 level10 level41)
(sum level31 level13 level44)
(sum level31 level21 level52)
(sum level32 level7 level39)
(sum level32 level10 level42)
(sum level32 level13 level45)
(sum level33 level7 level40)
(sum level33 level10 level43)
(sum level33 level13 level46)
(sum level34 level7 level41)
(sum level34 level10 level44)
(sum level34 level13 level47)
(sum level35 level7 level42)
(sum level35 level10 level45)
(sum level35 level13 level48)
(sum level36 level7 level43)
(sum level36 level10 level46)
(sum level36 level13 level49)
(sum level37 level7 level44)
(sum level37 level10 level47)
(sum level37 level13 level50)
(sum level38 level7 level45)
(sum level38 level10 level48)
(sum level38 level13 level51)
(sum level39 level7 level46)
(sum level39 level10 level49)
(sum level39 level13 level52)
(sum level40 level7 level47)
(sum level40 level10 level50)
(sum level41 level7 level48)
(sum level41 level10 level51)
(sum level42 level7 level49)
(sum level42 level10 level52)
(sum level43 level7 level50)
(sum level44 level7 level51)
(sum level45 level7 level52)

(connected l0 l1)
(fuelcost level13 l0 l1)
(connected l0 l2)
(fuelcost level10 l0 l2)
(connected l0 l3)
(fuelcost level10 l0 l3)
(connected l1 l0)
(fuelcost level13 l1 l0)
(connected l1 l2)
(fuelcost level7 l1 l2)
(connected l1 l3)
(fuelcost level21 l1 l3)
(connected l2 l0)
(fuelcost level10 l2 l0)
(connected l2 l1)
(fuelcost level7 l2 l1)
(connected l2 l3)
(fuelcost level24 l2 l3)
(connected l3 l0)
(fuelcost level10 l3 l0)
(connected l3 l1)
(fuelcost level21 l3 l1)
(connected l3 l2)
(fuelcost level24 l3 l2)

(at t0 l3)
(fuel t0 level52)
(= (total-cost) 0)

(at p0 l3)
(at p1 l1)
(at p2 l3)
(at p3 l1)
(at p4 l1)
)

(:goal
(and
(at p0 l0)
(at p1 l3)
(at p2 l2)
(at p3 l2)
(at p4 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 5
2. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 5
3. (drive t0 l3 l1 level31 level21 level52)
   deleted: (at t0 l3) (fuel t0 level52)
   added: (at t0 l1) (fuel t0 level31)
   goals met: 0 of 5
4. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 5
5. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 5
6. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 5
7. (drive t0 l1 l2 level24 level7 level31)
   deleted: (at t0 l1) (fuel t0 level31)
   added: (at t0 l2) (fuel t0 level24)
   goals met: 0 of 5
8. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 1 of 5
9. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 2 of 5
10. (drive t0 l2 l0 level14 level10 level24)
   deleted: (at t0 l2) (fuel t0 level24)
   added: (at t0 l0) (fuel t0 level14)
   goals met: 2 of 5
11. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 3 of 5
12. (drive t0 l0 l3 level4 level10 level14)
   deleted: (at t0 l0) (fuel t0 level14)
   added: (at t0 l3) (fuel t0 level4)
   goals met: 3 of 5
13. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 4 of 5
14. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 5 of 5
